### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.function_apps.module.function_app_support.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01"
        name                                           = "io-p-itn-wallet-supp-func-01"
      ~ tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "2.0.2" -> "3.0.0"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "0.3.1" -> "3.0.0"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-wallet-supp-func-01] Health Check Failed"
        name                     = "[io-p-itn-wallet-supp-func-01] Health Check Failed"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.2" -> "3.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnwalletsuppstfn01] Low Availability"
        name                     = "[iopitnwalletsuppstfn01] Low Availability"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "3.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-supp-func-pep-01"
        name                          = "io-p-itn-wallet-supp-func-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "3.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-supp-func-blob-pep-01"
        name                          = "io-p-itn-wallet-supp-func-blob-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.2" -> "3.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-supp-func-file-pep-01"
        name                          = "io-p-itn-wallet-supp-func-file-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.2" -> "3.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-supp-func-queue-pep-01"
        name                          = "io-p-itn-wallet-supp-func-queue-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.2" -> "3.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-supp-staging-func-pep-01"
        name                          = "io-p-itn-wallet-supp-staging-func-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "3.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-wallet-supp-asp-01"
        name                            = "io-p-itn-wallet-supp-asp-01"
      ~ tags                            = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.2" -> "3.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (12 unchanged attributes hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletsuppstfn01"
        name                               = "iopitnwalletsuppstfn01"
      ~ tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.2" -> "3.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02"
        name                                           = "io-p-itn-wallet-user-func-02"
      ~ tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "0.3.1" -> "2.0.2"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_monitor_metric_alert.function_app_health_check[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-wallet-user-func-02] Health Check Failed" -> (known after apply)
      ~ name                     = "io-p-itn-wallet-user-func-02] Health Check Failed" -> "[io-p-itn-wallet-user-func-02] Health Check Failed" # forces replacement
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      ~ target_resource_type     = "Microsoft.Web/sites" -> (known after apply)
        # (8 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourcegroups/io-p-itn-wallet-rg-01/providers/microsoft.insights/actiongroups/io-p-itn-wallet-ag-01" -> null
          - webhook_properties = {} -> null
        }
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourcegroups/io-p-rg-common/providers/microsoft.insights/actiongroups/ioperror" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnwalletuserstfn02] Low Availability"
        name                     = "[iopitnwalletuserstfn02] Low Availability"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourcegroups/io-p-itn-wallet-rg-01/providers/microsoft.insights/actiongroups/io-p-itn-wallet-ag-01" -> null
          - webhook_properties = {} -> null
        }
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourcegroups/io-p-rg-common/providers/microsoft.insights/actiongroups/ioperror" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-func-pep-02"
        name                          = "io-p-itn-wallet-user-func-pep-02"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_private_endpoint.st_blob must be replaced
-/+ resource "azurerm_private_endpoint" "st_blob" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-blob-pep-02" -> (known after apply)
      ~ name                          = "io-p-itn-wallet-user-blob-pep-02" -> "io-p-itn-wallet-user-func-blob-pep-02" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-wallet-user-blob-pep-02.nic.83884fac-7927-49df-9163-d013a39dfb4b"
              - name = "io-p-itn-wallet-user-blob-pep-02.nic.83884fac-7927-49df-9163-d013a39dfb4b"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-blob-pep-02/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnwalletuserstfn02.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.44",
                        ]
                      - name         = "iopitnwalletuserstfn02"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-blob-pep-02/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                              = "io-p-itn-wallet-user-blob-pep-02" -> "io-p-itn-wallet-user-func-blob-pep-02" # forces replacement
          ~ private_ip_address                = "10.20.2.44" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.function_apps.module.function_app_user_02.azurerm_private_endpoint.st_file must be replaced
-/+ resource "azurerm_private_endpoint" "st_file" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-file-pep-02" -> (known after apply)
      ~ name                          = "io-p-itn-wallet-user-file-pep-02" -> "io-p-itn-wallet-user-func-file-pep-02" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-wallet-user-file-pep-02.nic.74adc800-14b5-4ba8-bf78-26e0debe786e"
              - name = "io-p-itn-wallet-user-file-pep-02.nic.74adc800-14b5-4ba8-bf78-26e0debe786e"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-file-pep-02/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.file.core.windows.net"
              - name                = "privatelink.file.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnwalletuserstfn02.privatelink.file.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.46",
                        ]
                      - name         = "iopitnwalletuserstfn02"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-file-pep-02/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                              = "io-p-itn-wallet-user-file-pep-02" -> "io-p-itn-wallet-user-func-file-pep-02" # forces replacement
          ~ private_ip_address                = "10.20.2.46" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.function_apps.module.function_app_user_02.azurerm_private_endpoint.st_queue must be replaced
-/+ resource "azurerm_private_endpoint" "st_queue" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-queue-pep-02" -> (known after apply)
      ~ name                          = "io-p-itn-wallet-user-queue-pep-02" -> "io-p-itn-wallet-user-func-queue-pep-02" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-wallet-user-queue-pep-02.nic.2d74be37-47c4-4672-bfa6-677a2c1fb1ca"
              - name = "io-p-itn-wallet-user-queue-pep-02.nic.2d74be37-47c4-4672-bfa6-677a2c1fb1ca"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-queue-pep-02/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              - name                = "privatelink.queue.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnwalletuserstfn02.privatelink.queue.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.45",
                        ]
                      - name         = "iopitnwalletuserstfn02"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-queue-pep-02/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                              = "io-p-itn-wallet-user-queue-pep-02" -> "io-p-itn-wallet-user-func-queue-pep-02" # forces replacement
          ~ private_ip_address                = "10.20.2.45" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.function_apps.module.function_app_user_02.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-staging-func-pep-02"
        name                          = "io-p-itn-wallet-user-staging-func-pep-02"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-wallet-user-asp-02"
        name                            = "io-p-itn-wallet-user-asp-02"
      ~ tags                            = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (12 unchanged attributes hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserstfn02"
        name                               = "iopitnwalletuserstfn02"
      ~ tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-u-itn-wallet-user-func-01"
        name                                           = "io-u-itn-wallet-user-func-01"
      ~ tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-u-itn-wallet-user-func-01/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_monitor_metric_alert.function_app_health_check[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/io-u-itn-wallet-user-func-01] Health Check Failed" -> (known after apply)
      ~ name                     = "io-u-itn-wallet-user-func-01] Health Check Failed" -> "[io-u-itn-wallet-user-func-01] Health Check Failed" # forces replacement
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      ~ target_resource_type     = "Microsoft.Web/sites" -> (known after apply)
        # (8 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourcegroups/io-p-itn-wallet-rg-01/providers/microsoft.insights/actiongroups/io-p-itn-wallet-ag-01" -> null
          - webhook_properties = {} -> null
        }
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourcegroups/io-p-rg-common/providers/microsoft.insights/actiongroups/ioperror" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iouitnwalletuserstfn01] Low Availability"
        name                     = "[iouitnwalletuserstfn01] Low Availability"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourcegroups/io-p-itn-wallet-rg-01/providers/microsoft.insights/actiongroups/io-p-itn-wallet-ag-01" -> null
          - webhook_properties = {} -> null
        }
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourcegroups/io-p-rg-common/providers/microsoft.insights/actiongroups/ioperror" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-func-pep-01"
        name                          = "io-u-itn-wallet-user-func-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_private_endpoint.st_blob must be replaced
-/+ resource "azurerm_private_endpoint" "st_blob" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-blob-pep-01" -> (known after apply)
      ~ name                          = "io-u-itn-wallet-user-blob-pep-01" -> "io-u-itn-wallet-user-func-blob-pep-01" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-u-itn-wallet-user-blob-pep-01.nic.e9c4f5c4-6582-4d4c-b4d7-622aeba040c3"
              - name = "io-u-itn-wallet-user-blob-pep-01.nic.e9c4f5c4-6582-4d4c-b4d7-622aeba040c3"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-blob-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iouitnwalletuserstfn01.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.211",
                        ]
                      - name         = "iouitnwalletuserstfn01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-blob-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                              = "io-u-itn-wallet-user-blob-pep-01" -> "io-u-itn-wallet-user-func-blob-pep-01" # forces replacement
          ~ private_ip_address                = "10.20.2.211" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.function_apps.module.function_app_user_uat.azurerm_private_endpoint.st_file must be replaced
-/+ resource "azurerm_private_endpoint" "st_file" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-file-pep-01" -> (known after apply)
      ~ name                          = "io-u-itn-wallet-user-file-pep-01" -> "io-u-itn-wallet-user-func-file-pep-01" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-u-itn-wallet-user-file-pep-01.nic.c4f7b760-f32f-4aef-9277-b4f41ec76247"
              - name = "io-u-itn-wallet-user-file-pep-01.nic.c4f7b760-f32f-4aef-9277-b4f41ec76247"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-file-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.file.core.windows.net"
              - name                = "privatelink.file.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iouitnwalletuserstfn01.privatelink.file.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.206",
                        ]
                      - name         = "iouitnwalletuserstfn01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-file-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                              = "io-u-itn-wallet-user-file-pep-01" -> "io-u-itn-wallet-user-func-file-pep-01" # forces replacement
          ~ private_ip_address                = "10.20.2.206" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.function_apps.module.function_app_user_uat.azurerm_private_endpoint.st_queue must be replaced
-/+ resource "azurerm_private_endpoint" "st_queue" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-queue-pep-01" -> (known after apply)
      ~ name                          = "io-u-itn-wallet-user-queue-pep-01" -> "io-u-itn-wallet-user-func-queue-pep-01" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-u-itn-wallet-user-queue-pep-01.nic.5440cf83-6a9a-46f3-971a-a249f3adfcf5"
              - name = "io-u-itn-wallet-user-queue-pep-01.nic.5440cf83-6a9a-46f3-971a-a249f3adfcf5"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-queue-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              - name                = "privatelink.queue.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iouitnwalletuserstfn01.privatelink.queue.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.208",
                        ]
                      - name         = "iouitnwalletuserstfn01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-queue-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                              = "io-u-itn-wallet-user-queue-pep-01" -> "io-u-itn-wallet-user-func-queue-pep-01" # forces replacement
          ~ private_ip_address                = "10.20.2.208" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.function_apps.module.function_app_user_uat.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-user-staging-func-pep-01"
        name                          = "io-u-itn-wallet-user-staging-func-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/serverFarms/io-u-itn-wallet-user-asp-01"
        name                            = "io-u-itn-wallet-user-asp-01"
      ~ tags                            = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (12 unchanged attributes hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iouitnwalletuserstfn01"
        name                               = "iouitnwalletuserstfn01"
      ~ tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "2.0.2"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 8 to add, 25 to change, 8 to destroy.
```

</details>
